## PANDAS에서 제공하는 대표적인 자료구조

+ Series

+ DataFrame

+ https://pandas.pydata.org

In [1]:
import pandas as pd
import numpy as np

### 1. Series

+ 값 과 index를 하나로 합친 구조

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052])
print(s)
print(type(s))

0    9904312
1    3448737
2    2890451
3    2466052
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
for i in enumerate([9904312, 3448737, 2890451, 2466052]):
    print(i)

(0, 9904312)
(1, 3448737)
(2, 2890451)
(3, 2466052)

In [9]:
##### 인덱스를 자유롭게 지정

s = pd.Series([9904312, 3448737, 2890451, 2466052], index=["서울", "부산", "인천", "대구"])
print(s)

print("--------------------------------------------")

print(s.values, type(s.values))
print(s.index)

print("--------------------------------------------")

# 인덱스에 이름 지정
s.index.name = "도시"
print(s)

print("--------------------------------------------")

# Series 전체에 이름 지정
s.name = "인구"
print(s)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
--------------------------------------------
[9904312 3448737 2890451 2466052] <class 'numpy.ndarray'>
Index(['서울', '부산', '인천', '대구'], dtype='object')
--------------------------------------------
도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
--------------------------------------------
도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [10]:
##### 벡터화 연산

s1 = s / 1000000
print(s1)

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [18]:
##### 인덱싱

print(s[1], s["부산"])

print("-------------------------------------------")

print(s[1:3])
print(s["부산":"대구"])

print("-------------------------------------------")

print(s[[0, 3, 1]])
print(s[["서울", "대구", "부산"]])

print("-------------------------------------------")

print(s[(s>250e4) & (s<500e4)])

print("-------------------------------------------")

print(s.부산, ", ", s.서울)

3448737 3448737
-------------------------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64
-------------------------------------------
도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64
도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64
-------------------------------------------
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
-------------------------------------------
3448737 ,  9904312

In [36]:
##### Series와 dict

print("서울" in s)
print("대전" in s)

print("-------------------------------------------")

print(list(s.items()))

print("-------------------------------------------")

s2 = pd.Series({"서울":9631482, "부산":3448737, "인천":2632035, "대전":1490158})
print(s2)

True
False
-------------------------------------------
[('서울', 9904312), ('부산', 3448737), ('인천', 2890451), ('대구', 2466052)]
-------------------------------------------
서울    9631482
부산    3448737
인천    2632035
대전    1490158
dtype: int64

In [31]:
##### 인덱스 기반 연산

print(s)
print("--------------------------")
print(s2)
print("--------------------------")

result = s - s2
print(result)

print("--------------------------")

print(s.values - s2.values)

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64
--------------------------
서울    9904312
부산    3448737
인천    2890451
대전    1490158
dtype: int64
--------------------------
대구    NaN
대전    NaN
부산    0.0
서울    0.0
인천    0.0
dtype: float64
--------------------------
[     0      0      0 975894]

In [38]:
##### 결측치 제거

print(result)
print(result.notnull())
print(result[result.notnull()])

print("-------------------------------------------------")

# s와 s2 데이터를 이용해서 인구 증가율 : (끝 연도 - 시작 연도) / 시작 연도 * 100
result2 = (s2 - s) / s * 100
print(result2)

result2 = result2[result2.notnull()]
print(result2)

대구    NaN
대전    NaN
부산    0.0
서울    0.0
인천    0.0
dtype: float64
대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool
부산    0.0
서울    0.0
인천    0.0
dtype: float64
-------------------------------------------------
대구         NaN
대전         NaN
부산    0.000000
서울   -2.754659
인천   -8.940335
dtype: float64
부산    0.000000
서울   -2.754659
인천   -8.940335
dtype: float64

In [42]:
##### 데이터를 수정, 삭제, 갱신

result2["부산"] = 1.63     # 수정
print(result2)

result2["대구"] = 1.41     # 갱신
print(result2)

del result2["서울"]        # 삭제
print(result2)

부산    1.630000
서울   -2.754659
인천   -8.940335
대구    1.410000
dtype: float64
부산    1.630000
서울   -2.754659
인천   -8.940335
대구    1.410000
dtype: float64
부산    1.630000
인천   -8.940335
대구    1.410000
dtype: float64

### 2. DataFrame

+ 여러 개의 Series를 묶어놓은 형태

In [43]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

In [45]:
print(type(data))
print(data)

<class 'dict'>
{'2015': [9904312, 3448737, 2890451, 2466052], '2010': [9631482, 3393191, 2632035, 2431774], '2005': [9762546, 3512547, 2517680, 2456016], '2000': [9853972, 3655437, 2466338, 2473990], '지역': ['수도권', '경상권', '수도권', '경상권'], '2010-2015 증가율': [0.0283, 0.0163, 0.0982, 0.0141]}

In [47]:
df = pd.DataFrame(data)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

      2015     2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2431774  2456016  2473990  경상권         0.0141

#### (1) 컬럼의 순서(위치) 바꾸기

In [51]:
# ?pd.DataFrame

cols = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]

df = pd.DataFrame(data, columns=cols)
df

    지역     2015     2010     2005     2000  2010-2015 증가율
0  수도권  9904312  9631482  9762546  9853972         0.0283
1  경상권  3448737  3393191  3512547  3655437         0.0163
2  수도권  2890451  2632035  2517680  2466338         0.0982
3  경상권  2466052  2431774  2456016  2473990         0.0141

#### (2) 인덱스 변경

In [52]:
idx = ["서울", "부산", "인천", "대구"]

df = pd.DataFrame(data, columns=cols, index=idx)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [53]:
print(df.values)
print(df.columns)
print(df.index)

[['수도권' 9904312 9631482 9762546 9853972 0.0283]
 ['경상권' 3448737 3393191 3512547 3655437 0.0163]
 ['수도권' 2890451 2632035 2517680 2466338 0.0982]
 ['경상권' 2466052 2431774 2456016 2473990 0.0141]]
Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')
Index(['서울', '부산', '인천', '대구'], dtype='object')

In [54]:
##### 컬럼과 인덱스에 이름 지정

df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [55]:
##### 전치 가능
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

#### (3) 인덱싱

In [65]:
##### 열 인덱싱

print(df)
print("--------------------------------------------------------------------------")

print(df["지역"])
print(type(df["지역"]))

print("--------------------------------------------------")

print(df[["지역"]])
print(type(df[["지역"]]))

print("--------------------------------------------------")

print(df[["2015", "2010"]])

# df[0]
# df[["2015" : "2010"]]

SyntaxError: invalid syntax (<ipython-input-65-ffa0c63ddb03>, line 19)

In [73]:
##### 행 인덱싱 (반드시 : 으로 슬라이싱)

print(df[:])
print("--------------------------------------------------")
print(df[:1])
print("--------------------------------------------------")
print(df[1:3])
print("--------------------------------------------------")
print(df["서울":"부산"])

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141
--------------------------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
--------------------------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
--------------------------------------------------
특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [78]:
##### 동시에 행과 열에 접근

print(df["2005"]["서울"])
# print(df["2005", "서울"])

print("----------------------------------------------")

# 2005년도와 2010년도의 서울 인구 조회
df[["2005", "2010"]][:"서울"]

9762546
----------------------------------------------

특성     2005     2010
도시
서울  9762546  9631482

#### (4) 열 데이터 갱신, 추가, 삭제

In [81]:
# 갱신
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

# 추가
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

# 삭제
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

#### (5) 실습

In [82]:
data = {
    "국어" : [80, 90, 70, 30], 
    "영어" : [90, 70, 60, 40], 
    "수학" : [90, 60, 80, 70]
}

In [ ]:
##### 1. 인덱스를 춘향, 몽룡, 향단, 방자로 구성된 데이터 프레임 df를 작성

In [ ]:
##### 2. 모든 학생의 수학 점수를 조회

In [ ]:
##### 3. 모든 학생의 국어와 영어 점수를 조회

In [ ]:
##### 4. 모든 학생의 각 과목평균점수를 새로운 열(과목평균)로 추가하시오

In [ ]:
##### 5. 방자의 영어점수를 80점으로 수정하고 평균점수도 다시 수정하시오

In [ ]:
##### 6. 춘향의 점수를 데이터 프레임 형식으로 출력하시오.

In [ ]:
##### 7. 향단의 점수를 Series로 출력하시오.

#### (6) 파일 입출력

+ read_csv()
+ to_csv()
+ read_table()

In [84]:
%%writefile data/sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting data/sample1.csv

In [85]:
sample1 = pd.read_csv("data/sample1.csv")
sample1

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [86]:
%%writefile data/sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting data/sample2.csv

In [88]:
sample2 = pd.read_csv("data/sample2.csv", names=["c1", "c2", "c3"])
sample2

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [89]:
# 특정한 열을 인덱스로 지정

sample3 = pd.read_csv("data/sample1.csv", index_col="c1")
sample3

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [90]:
%%writefile data/sample3.txt
c1     c2     c3       c4
0.23   0.33   0.354    0.2389
0.123  0.345  0.567    0.986

Overwriting data/sample3.txt

In [92]:
sample3 = pd.read_table("data/sample3.txt", sep="\s+")
sample3

      c1     c2     c3      c4
0  0.230  0.330  0.354  0.2389
1  0.123  0.345  0.567  0.9860

In [93]:
%%writefile data/sample4.txt
파일제목 : sample4.txt
데이터포맷의 설명 : 어쩌구 저쩌구
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting data/sample4.txt

In [97]:
# sample4 = pd.read_table("data/sample4.txt", skiprows=[0, 1], sep=",")
sample4 = pd.read_table("data/sample4.txt", skiprows=2, sep=",")
sample4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [98]:
%%writefile data/sample5.csv
c1, c2, c3
1, 1.11, 
2, , two
누락, 3.33, three

Overwriting data/sample5.csv

In [99]:
sample5 = pd.read_csv("data/sample5.csv", na_values=[" ", "누락"])
sample5

    c1    c2      c3
0  1.0  1.11     NaN
1  2.0   NaN     two
2  NaN  3.33   three

In [106]:
##### 저장

df.to_csv("data/sample6.csv")
df.to_csv("data/sample7.txt", sep="|")
df.to_csv("data/sample8.csv", index=False, header=False)
sample5.to_csv("data/sample9.txt", sep=":", na_rep="누락")

In [103]:
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99